In [8]:
%pip install pandas

In [9]:
import pandas as pd
import numpy as np

In [12]:
df = pd.read_csv("./Book1.csv")
df.head()

,kelas,guru,tanggal,kebersihan,kerapian,kelengkapan_fasilitas,seragam_sepatu,keaktifan,mengingatkan,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,7C,Laila Dzikria,7/23/2024,75,50,60,25,25,66,NaN,NaN,NaN,NaN,NaN
1,7C,Ustadzah Fadhilah Nisa,7/25/2024,75,75,60,25,25,33,NaN,NaN,NaN,NaN,NaN
2,9C,Laila Dzikria,7/26/2024,75,75,60,100,75,66,NaN,NaN,NaN,NaN,NaN
3,9C,Ustadzah Fadhilah Nisa,7/25/2024,50,50,60,100,25,33,NaN,NaN,NaN,NaN,NaN
4,7C,Ustadzah Hilmi Gianti,7/29/2024,75,50,80,25,25,66,NaN,NaN,NaN,NaN,NaN

In [13]:
df.columns

Index(['kelas', 'guru', 'tanggal', 'kebersihan', 'kerapian',
       'kelengkapan_fasilitas', 'seragam_sepatu', 'keaktifan', 'mengingatkan',
       'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12',
       'Unnamed: 13'],
      dtype='object')

In [14]:
df.drop(columns=['Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12',
       'Unnamed: 13'], inplace=True)

In [24]:
agg = df.groupby('kelas').mean(['kebersihan', 'kerapian',
       'kelengkapan_fasilitas', 'seragam_sepatu', 'keaktifan', 'mengingatkan'])

In [28]:
agg['akhir'] = agg.mean(axis=1)

In [30]:
agg.round(2)

,kebersihan,kerapian,kelengkapan_fasilitas,seragam_sepatu,keaktifan,mengingatkan,akhir
kelas,,,,,,,
7A,65.91,63.64,80.00,93.18,65.91,63.00,71.94
7B,54.55,54.55,78.18,86.36,63.64,57.00,65.71
7C,66.18,63.24,74.12,69.12,41.18,71.82,64.27
8A,64.29,58.93,77.14,89.29,66.07,61.29,69.50
8B,53.57,53.57,72.86,83.93,55.36,58.93,63.04
8C,61.36,63.64,76.36,86.36,61.36,63.00,68.68
9A,72.22,69.44,62.22,75.00,69.44,47.67,66.00
9B,62.50,62.50,57.50,71.88,59.38,49.50,60.54
9C,62.50,64.29,64.29,100.00,64.29,54.21,68.26

In [31]:
df

,kelas,guru,tanggal,kebersihan,kerapian,kelengkapan_fasilitas,seragam_sepatu,keaktifan,mengingatkan
0,7C,Laila Dzikria,7/23/2024,75,50,60,25,25,66
1,7C,Ustadzah Fadhilah Nisa,7/25/2024,75,75,60,25,25,33
2,9C,Laila Dzikria,7/26/2024,75,75,60,100,75,66
3,9C,Ustadzah Fadhilah Nisa,7/25/2024,50,50,60,100,25,33
4,7C,Ustadzah Hilmi Gianti,7/29/2024,75,50,80,25,25,66
...,...,...,...,...,...,...,...,...,...
104,9A,Ust. Habib Rizieq,8/6/2024,75,50,0,100,50,33
105,9B,Ust. Habib Rizieq,8/6/2024,50,50,0,100,50,33
106,9C,Isma istiqomah,8/6/2024,50,50,80,100,50,66
107,7C,Isma istiqomah,8/8/2024,50,50,80,100,50,66
108,8C,Isma istiqomah,8/8/2024,50,50,80,100,50,66

In [45]:
df = pd.read_csv("./Book1.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   kelas                  125 non-null    object
 1   guru                   125 non-null    object
 2   tanggal                125 non-null    object
 3   kebersihan             125 non-null    object
 4   kerapian               125 non-null    object
 5   kelengkapan_fasilitas  125 non-null    int64
 6   seragam_sepatu         125 non-null    object
 7   keaktifan              125 non-null    object
 8   mengingatkan           125 non-null    object
 9   Unnamed: 9             0 non-null      float64
 10  Unnamed: 10            0 non-null      float64
 11  Unnamed: 11            0 non-null      float64
 12  Unnamed: 12            0 non-null      float64
 13  Unnamed: 13            0 non-null      float64
dtypes: float64(5), int64(1), object(8)
memory usage: 9.8+ KB

In [89]:
df.info(15)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   kelas                  125 non-null    object
 1   guru                   125 non-null    object
 2   tanggal                125 non-null    object
 3   kebersihan             125 non-null    object
 4   kerapian               125 non-null    object
 5   kelengkapan_fasilitas  125 non-null    int64
 6   seragam_sepatu         125 non-null    object
 7   keaktifan              125 non-null    object
 8   mengingatkan           125 non-null    object
dtypes: int64(1), object(8)
memory usage: 5.0+ KB

In [76]:
df['mengingatkan'].replace({'Membiarkan':33, 'Terus/Selalu Membangunkan':99, 'Membangunkan':66}, inplace=True)

In [ ]:
df['keaktifan'].replace({'4. Sangat Aktif':100, '3. Aktif':75,
       '2. Cukup Aktif':50, '1. Kurang Aktif':25}, inplace=True)

In [82]:
df.dropna(axis=1, inplace=True)

In [84]:
# df['kelengkapan_fasilitas'].replace({5: 100, 2: 40, 1: 20, 3: 60, 4: 80}, inplace=True)

In [85]:
df.columns

Index(['kelas', 'guru', 'tanggal', 'kebersihan', 'kerapian',
       'kelengkapan_fasilitas', 'seragam_sepatu', 'keaktifan', 'mengingatkan'],
      dtype='object')

In [101]:
df[['kebersihan', 'kerapian',
       'kelengkapan_fasilitas', 'seragam_sepatu', 'keaktifan', 'mengingatkan']] = df[['kebersihan', 'kerapian',
       'kelengkapan_fasilitas', 'seragam_sepatu', 'keaktifan', 'mengingatkan']].astype(int)

In [102]:
df.groupby('kelas').mean(['kebersihan', 'kerapian',
       'kelengkapan_fasilitas', 'seragam_sepatu', 'keaktifan', 'mengingatkan'])

,kebersihan,kerapian,kelengkapan_fasilitas,seragam_sepatu,keaktifan,mengingatkan
kelas,,,,,,
7A,66.666667,64.583333,80.000000,93.750000,66.666667,63.250000
7B,56.250000,56.250000,78.333333,87.500000,64.583333,57.750000
7C,62.500000,61.250000,75.000000,73.750000,41.250000,67.650000
8A,64.705882,60.294118,74.117647,86.764706,64.705882,64.058824
8B,57.812500,56.250000,75.000000,85.937500,57.812500,59.812500
8C,61.538462,65.384615,75.384615,88.461538,61.538462,63.461538
9A,72.500000,67.500000,60.000000,77.500000,67.500000,46.200000
9B,61.111111,61.111111,55.555556,75.000000,58.333333,47.666667
9C,60.937500,62.500000,61.250000,100.000000,64.062500,51.562500

In [106]:
agg = df.groupby('kelas').mean(['kebersihan', 'kerapian',
       'kelengkapan_fasilitas', 'seragam_sepatu', 'keaktifan', 'mengingatkan'])
agg['rata2_akhir'] = agg.mean(axis=1)

In [107]:
agg.round(2)

,kebersihan,kerapian,kelengkapan_fasilitas,seragam_sepatu,keaktifan,mengingatkan,rata2_akhir
kelas,,,,,,,
7A,66.67,64.58,80.00,93.75,66.67,63.25,72.49
7B,56.25,56.25,78.33,87.50,64.58,57.75,66.78
7C,62.50,61.25,75.00,73.75,41.25,67.65,63.57
8A,64.71,60.29,74.12,86.76,64.71,64.06,69.11
8B,57.81,56.25,75.00,85.94,57.81,59.81,65.44
8C,61.54,65.38,75.38,88.46,61.54,63.46,69.29
9A,72.50,67.50,60.00,77.50,67.50,46.20,65.20
9B,61.11,61.11,55.56,75.00,58.33,47.67,59.80
9C,60.94,62.50,61.25,100.00,64.06,51.56,66.72